spec/fixtures/services/info/get_unit_count-req.xml

<?xml version='1.0' encoding='UTF-8'?>
<env:Envelope
    xmlns:xsd='http://www.w3.org/2001/XMLSchema'
    xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
    xmlns:env='http://schemas.xmlsoap.org/soap/envelope/'
    xmlns='https://adwords.google.com/api/adwords/cm/v201008'
    xmlns:s='https://adwords.google.com/api/adwords/info/v201008'>
  <env:Header>
    <s:RequestHeader env:mustUnderstand='0'>
      <authToken>
        ***censured***
      </authToken>
      <userAgent>
        Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)
      </userAgent>
      <developerToken>
        ***censured***
      </developerToken>
    </s:RequestHeader>
  </env:Header>
  <env:Body>
    <s:get>
      <s:selector>
        <s:dateRange>
          <min>
            20090101
          </min>
          <max>
            20091105
          </max>
        </s:dateRange>
        <s:apiUsageType>
          UNIT_COUNT_FOR_CLIENTS
        </s:apiUsageType>
      </s:selector>
    </s:get>
  </env:Body>
</env:Envelope>
